<html>
<head>
<title>KernelPS - Revision History</title>
</head>
<style type="text/css">
 body {
  font-family:Arial, Helvetica, sans-serif;
  size:9px;
  line-height:20px;
 }
</style>
<body>

<table width="100%" border="0" cellpadding="5" cellspacing="0">
  <tr>
    <td align="center" bgcolor="#264b99"></font><font size="6" color="#FFFFFF"><b>KernelPS</b></font><font size="2"><br>
    <b><font size="4" color="#FFFFFF">Revision History - General </font></b></td>
  </tr>
</table>

<p>
<span style="font-size: 12px">Copyright ©&nbsp;
<a href="http://www.proevento.com.br" target="_blank" style="text-decoration:none;"><b>PROEVENTO</b> - T E C H N O L O G I E S</a>.<br>
All rights reserved.</span>
</p>
<br>

<h3>v5 </h3>
<ul>
  <font face="verdana,arial" size="2">
  <li>Módulos passam a ser implementados pela páginas da pasta "_fontes"</li>
  <li></li>
  <li></li>
  </font>
</ul>

<h3>v4 </h3>
<ul>
  <font face="verdana,arial" size="2">
  <li>Descri&ccedil;&atilde;o para M&oacute;dulos e Dialogs</li>
  <li>Novos m&oacute;dulos nativos - agenda, todolist - financeiro (modelo VBOSS)</li>
  <li>Maior compatibilidade com outros navegadores (DOCTYPE transational contemplado no n&uacute;cleo)</li>
  <li>Relat&oacute;rios com gera&ccedil;&atilde;o de arquivos (html e csv), Framework para relat&oacute;rios ST extendido</li>
  <li>Extens&atilde;o das fun&ccedil;&otilde;es ASL - combo, arquivos CSV, etc...</li>
  <li>FrameWork de MiniApps e MFormApps definido</li>
  <li>Sistema de controle de Frames para MiniApps modificado e re-organizado </li>
  <li>Usu&aacute;rios passam a ter seus direitos refenciados, ou seja, caso o usu&aacute;rio tenha refer&egrave;ncia a um outros usu&aacute;rio, o mesmo utiliza dos direitos do usu&aacute;rio referenciado</li>
  <li>Campos dos filtros agora podem exibir conteúdo dos campos obs e descrição</li>
  <li>Editor de MenuMX: como Bookmark para o módulo MenuMX(Abas)</li>
  <li>Atualização da insupdelmastereditor.php sobre o scontrole de abertura da dialog em popup</li>
  <li>Possibilidade de usar funções javascript na OnLoad do módulo e/da tela do editor genérico</li>
  </font>
</ul>

<h3>v3 </h3>

<ul>
  <font face="verdana,arial" size="2">
  <li>Forma&ccedil;&atilde;o dos Bookmarks </li>
  <li>Implementa&ccedil;&atilde;o do conceito e modelo de MENU MX </li>
  <li>Adi&ccedil;&atilde;o ao suporte deeventos e fun&ccedil;&otilde;es JScript individuais a cada campo de um m&oacute;dulo</li>
  <li>Nova biblioteca de fun&ccedil;&otilde;es de conscist&ecirc;ncia disponibilizada como nativa </li>
  <li>Todos os par&acirc;metros de incicializa&ccedil;&atilde;o dos m&oacute;dulos est&atilde;o em Session </li>
  <li>Extens&atilde;o das fun&ccedil;&otilde;es ASL - soma, agrupamentos, etc... </li>
  <li>M&oacute;dulos nativos (usu&aacute;ios, entidade, etc..) </li>
  </font>
</ul>

<h3>v2 </h3>
<ul>
	<font face="verdana,arial" size="2">
  <li>Legenda para marcadores dos &iacute;tens e para a pesquisa de hist&oacute;rico de
    retiradas/devolu&ccedil;&otilde;es</li>
  <li>Wizard que permite a gera&ccedil;&atilde;o autom&aacute;tica de m&oacute;dulos apartir de uma tabela </li>
  <li>M&oacute;dulos ganham a flexibilidade de novos executores de grade </li>
  <li>Implementa&ccedil;&atilde;o do m&oacute;dulo de relat&oacute;rios baseado em ASL - SQL </li>
  <li>Sistema permite gera&ccedil;&atilde;o de m&oacute;dulos atrav&eacute;s deconfigura&ccedil;&otilde;es de campos, e tabelas</li>
  <li>Dele&ccedil;&atilde;o e Visualiza&ccedil;&atilde;o gen&eacute;ricas</li>
  <li>N&uacute;cleo - athINSToDb (upd e del) implantado em PHP, dando suporte para o framework de trabalho </li>
  <li>Estabelecida regra de montagem dos m&oacute;dulos e sua estrutura basica definida (filtro,  grade e dialog) </li>
  </font>
</ul>
	
<h3>v1 </h3>
<ul>
<font face="verdana,arial" size="2">
  <li>Vers&atilde;o conceitual - Framework e Kernel para gera&ccedil;&atilde;o de sistemas, otimiza&ccedil;&atilde;o de processos de programa&ccedil;&atilde;o,<br>
    edi&ccedil;&atilde;o de fontes e desenvolvimento de aplica&ccedil;&otilde;es em geral. by Aless Oliveira<br>
</li>
</font>
</ul>
<p>&nbsp;</p>
<table width="100%" border="0" cellpadding="5" cellspacing="0">
  <tr>
    <td align="center" bgcolor="#264b99"><font size="6"color="#FFFFFF"><b>KernelPS</b></font><font size="2"><br>
    <b><font size="4" color="#FFFFFF">Revision History - Developers </font></b></font></td>
  </tr>
</table>


<h3 align="left"><font color="#264B99">v5.0.0.0 (05/09/2012 a ...) </font></h3>
<ul><font face="verdana,arial" size="2">
  <li>
    <p align="left"><font color="#264B99">...</font></p>
  </li>
</font></ul>

<h3><font color="#264B99"></font>v4.7.1-9 (10/10/2011 a 05/09/2012) </h3>
<font face="verdana,arial" size="2">
<ul>
<li>Usu&aacute;rios passam a ter seus direitos refenciados, ou seja, caso o usu&aacute;rio tenha refer&ecirc;ncia a um outros usu&aacute;rio, o mesmo utiliza dos direitos do usu&aacute;rio referenciado</li>
<li>Campos dos filtros agora podem exibir conteúdo dos campos obs e descrição</li>
<li>Função <i>formatInputHourMinute</i> foi substituída por  <i>FormataInputHoraMinuto</i> que possui um parâmetro a mais que referencia o evento e, por isso, passa a funcionar para funcionar para outros browsers</li>
<li>Função <i>reSizeiFrame</i> para fazer redimensionamento de iframes. Serve basicamente para painéis que exibem vários tipos de dados em diversos iframes. Para um iframe com v&aacute;rios dados, uma barra de rolagem vertical aparecerá. Para esse caso, se o usuário quiser ver tudo, ele irá clicar num ícone que chama essa função e faz com que o iframe seja redimensionado exibindo tudo.</li>
<li>Função <i>is_date</i> estava passando apenas dois dígitos do ano informado para a função <i>checkdate</i>. Devido a isso, retornava falso para algumas datas como 29/02 com um ano qualquer inferior a 2000.</li>
<li>Função <i>is_date</i> estava passando apenas dois dígitos do ano informado para a função <i>checkdate</i>. Devido a isso, retornava falso para algumas datas como 29/02 com um ano qualquer inferior a 2000.</li>  
<li>Atualização da insupdelmastereditor.php sobre o controle de abertura da dialog em popup. Criação da <i>athclosedlg.php</i> - necessáriao para o processo onde as DIALOGS (inupdelmastereditor.php) são chamadas em POPUP</li>
<li>...</li>
</ul>
</font>
<h3><font color="#264B99"></font>v4.6.1-9 (20/05/2011 a 06/06/2011) </h3>
<ul><font face="verdana,arial" size="2">
  <li>Atualiza&ccedil;&atilde;o no Kernel UPDATES repassada para os demais 
  sistemas.</li>
  <li>    Kernel com suporte a DOCTYPE (desde 2010, propagado agora 
    para os demais sistemas)</li>
  <li>Novo CSS e interpreta&ccedil;&atilde;o 
    diferenciada de valores antes em atributos de TAGs, como <br>
    'width', para style='width...'</li>
  <li>  Ajuste dos campos do wizard de gera&ccedil;&atilde;o de m&oacute;dulos</li>
  <li>    Novos campos para 'Descri&ccedil;&atilde;o de m&oacute;dulos' (parte do
    prj a gera&ccedil;&atilde;o de forms para a AR)</li>
  <li>  Implementa&ccedil;&atilde;o dos par&acirc;metros do tipo COMBO para relat&oacute;rios 
  ASLW <br>
  * nova tabela de SQL auxiliar alimenta os valores dos 
  combos</li>
</font></ul>

<h3>v4.5.1-9 (10/02/2010 a 14/08/2010) </h3>

<ul><font face="verdana,arial" size="2">
  <li>  Novo m&oacute;dulo de relat&oacute;rios modulo_ASLWRelatorio<br>
  ** Lembrando que ele tem de ser atualizado manualmente 
  nos sistemas do kernel</li>
  <li>Salvamento de usu&aacute;rio de BD toda vez que usu&aacute;rio do 
    sistema faz 'login'. Isto &eacute; a base <br>
    para gravar os logs das 
    a&ccedil;&otilde;es dos usu&aacute;rios, que ser&aacute; usado para se auditar mais 
    tarde.</li>
  <li> Corre&ccedil;&atilde;o de bug na insupddelmastereditor.php na 
    execu&ccedil;&atilde;o de javascript para campos <br>
    INPUT do tipo RADIO,
  que n&atilde;o estavam sendo disparados</li>
  <li> Inser&ccedil;&atilde;o do padr&atilde;o DOCTYPE xhtml-transational 1.0
  em todos os arquivos pertencentes <br>
  ao kernel.</li>
  <li> Otimiza&ccedil;&atilde;o do CSS default (default.css)</li>
  <li> Cria&ccedil;&atilde;o de novas classes CSS para facilitar a 
    manipula&ccedil;&atilde;o de layout dos sistemas <br>
    nos arquivos de
  modulo do kernel</li>
  <li> Corre&ccedil;&atilde;o de bug na insupddelmastereditor.php na
    a&ccedil;&atilde;o &quot;visualiza&ccedil;&atilde;o&quot; no tipo combo. <br>
    N&atilde;o havia tratamento
    de variaveis de sess&atilde;o no par&acirc;metro SQL ({})</li>
</font></ul>

<h3>v4.4.1-9 (24/09/2009 a 04/12/2009) </h3>

<ul><font face="verdana,arial" size="2">
  <li> Anexada fun&ccedil;&atilde;o EditaCampos() (no scripts.js) que
  permite a chamada de um <br>
  editor HTML para edi&ccedil;&atilde;o de dados 
de um campo. Exemplod e uso:<br>
  * Na DESCRIC&Atilde;O de um campo, digamos TEXSTO,coloca-se o c&oacute;digo <br>
&lt;a href=&quot;javascript: EditaCampos('0','dbvar_str_texto&ocirc;_000');&quot;&gt;<br>
&lt;img src=../img/bt_editHTML.gif  
  border=0 
  alt=&quot;Editor HTML&quot; 
  title=&quot;Editor HTML&quot;&gt;
&lt;/a&gt;<br>
*Obs.: O Editor ainda possui um pequeno bugs, mas poder&aacute; ser 
  atualizado postreriormente</li>
  <li> Possibilidade de criar um menu pureCSS que devem ser 
  utilizados no topo das grades tablesort <br>
  (n&atilde;o utilizar mais
  o bot&atilde;o 'insert' na direita). <br>
  Fun&ccedil;&otilde;es de cria&ccedil;&atilde;o de menu:<br>athBeginCssMenu();<br>
  athCssMenuAddItem(&quot;STrvstacao.php&quot;,&quot;_self&quot;,&quot;RELA&Ccedil;&Otilde;ES&quot;,1);<br>
  athBeginCssSubMenu();<br>
  athCssMenuAddItem(&quot;STinsRelacao.php&quot;,&quot;_self&quot;,&quot;Inserir&quot;);<br>
  athCssMenuAddItem(&quot;STdelrelacao.php&quot;,&quot;_self&quot;,&quot;Del all&quot;);<br>
  athEndCssSubMenu();<br>
  athEndCssMenu();<br>
  <br>
  obs: exemplo de uso em 
  'X:\datawide\_datawide\modulo_rv_revista\STrevistarelacao.php'</li>
  <li> Adicionada a possibilidade de n&atilde;o executar o die na
  fun&ccedil;&atilde;o verficarAcesso()</li>
  <li> Corre&ccedil;&atilde;o na fun&ccedil;&atilde;o javascript ajaxMontaEdit para
  retornar o primeiro campo da consulta informada</li>
  <li> Corre&ccedil;&atilde;o nas fun&ccedil;&otilde;es Box para uso com porcentagem</li>
  <li> Corre&ccedil;&atilde;o no preparador de relatorios ASLW nativo do
  kernel </li>
  <li> N&atilde;o podemos usar ONLINE a getimagesize 
  *retirada da insupddelmastereditor (ln 505)</li>
  <li> Revis&atilde;o e padroniza&ccedil;&atilde;o na l&oacute;gica de retorno e 
    gerenciamento de erros dos scripts PHP para uso em AJAX</li>
  <li> Produ&ccedil;&atilde;o do modelo de script PHP para ajax 
  (/_ajax/_modelo.php)</li>
  <li> Ajustes nas telas que usam as rotinas AJAX que n&atilde;o
  estavam no padr&atilde;o estabalecido</li>
  <li> Ajuste nas fun&ccedil;&otilde;es de javascript para unifica&ccedil;&atilde;o 
  definitiva do arquivo &quot;scripts.js&quot; entre os sistemas</li>
  <li> Remo&ccedil;&atilde;o dos scripts PHP para ajax que n&atilde;o tem uso
  gen&eacute;rico.</li>
  <li> Implementa&ccedil;&atilde;o das marca&ccedil;&otilde;es ASLW nas datas de modulo.</li>
  <li> Ajuste na express&atilde;o regular da updater que pega a 
    ultima vers&atilde;o</li>
  <li>A fun&ccedil;&atilde;o ajaxDetailData no scripts.js possui a op&ccedil;&atilde;o
  de preenchimento de edits</li>
  <li> Produ&ccedil;&atilde;o da dialog est&aacute;tica de modelo (STdialog.php)</li>
  <li> Permitir que campos de filtro do tipo DATEINTERVAL
    aceitem datas e expressoes de datas baseadas no SQL do <br>
    PostgreSQL. 
    Ex: <br>
    current_timestamp - current_timestamp + '7 days'<br>
    Significa, da data atual at&eacute; daqui a 7 dias</li>
  <li> Ajuste no CSS do componente tablesort para que n&atilde;o
  conflito com o CSS padr&atilde;o.</li>
  <li> Cria&ccedil;&atilde;o das STs de scripts de apoio em js e php 
  (STscripts.js e STathutils.php)<br>
  </li>
</font></ul>

<h3>v4.3.1-9 (05/08/2009 a 22/09/2009) </h3>

<ul><font face="verdana,arial" size="2">
  <li> Uso das constantes do STconfiginc.php para envio de
  email e troca do leiaute do email</li>
  <li> Executor de EsqueciSenha usava constantes de email
  antigas</li>
  <li> Grade de dados estilo tablesort ajustada relacionamento por links entre relatorios aslw</li>
  <li> Grade de dados estilo tablesort implementada como opcional</li>
  <li> Inser&ccedil;&atilde;o do tipo de campo captcha no kernel</li>
  <li> Retirada dos n&uacute;meros de registros totais e total
    de p&aacute;ginas na grade (data.php)</li>
  <li> Retirada do &quot;tabindex&quot; dos campos da dialog padr&atilde;o</li>
  <li> O formulario que dispara a exporta&ccedil;&atilde;o (mxfooter.php)
    estava sem m&eacute;todo. <br>
    Foi colocado o m&eacute;todo post neste
    formul&aacute;rio.</li>
  <li>Express&atilde;o regular na DataPreper para identifica&ccedil;&atilde;o do &quot;var_&quot;</li>
  <li> Troca do icone de pesquisa : icon_search na 
    INSUPDDELMATEREDITOR.PHP</li>
  <li> Config.PHP muda para STConfig  ganha um novo editor 
  de defines.</li>
  <li>Cria&ccedil;&atilde;o de tipo de dados novo chamado STATUS que afetar&aacute; 
    o campo &quot;dtt_inativo&quot; <br>
    de cada tabela; o campo poder&aacute; ser 
    exibido como COMBO ou RADIO</li>
</font></ul>

<h3>v4.2.1-9 (07/04/2009 a 12/05/2009) </h3>

<ul><font face="verdana,arial" size="2">
  <li>  Montagem dos links do Menu MX espera que o path &quot;../img/&quot; 
  venha no link da <br>
  imagem; n&atilde;o est&aacute; mais fixo nos fontes</li>
  <li>Troca do nome da imagem de &quot;system_logo_parteB.gif&quot; para&quot;system_logo_parteb.gif&quot;</li>
  <li>    Se a grade tem uma a&ccedil;&atilde;o default e ela retornou apenas uma 
    linha ela dispara a <br>
  a&ccedil;&atilde;o default</li>
  <li>    Possibilidade de colocar tipo checkbox nos itens da grid.</li>
  <li>    Estavamos com problema no default de um valor numa pesquisa
    quando adicionamos <br>
    a 'feature' dos fields detail devido a 
  uma logica errada. Consertada</li>
  <li>    Quando era chamada uma popup de um modulo com o 
    stracao= single sumia os icones <br>
    da grid, ok. Mas ao voltar 
    ao modulo atraves da interface os icones continuavam<br>
    escondidos. Ajustado. </li>
  <li>  Largura da &aacute;rea para coloca&ccedil;&atilde;o dos icones de Links da grade
  da data.php.<br>
  Constantes de layout:<br>
  *Importante que no configinc.php tenha a defini&ccedil;&atilde;o da 
  seguinte constante: define(&quot;CL_LINK_WIDTH&quot;,&quot;18&quot;); //25</li>
  <li> Corre&ccedil;&atilde;o de bug de background na 
  insupddelmastereditor.php quando o era chamada atraves<br>
  de um detail, ela estava ficando com o background de sistema
  ao inves de branco.</li>
  <li> O background dos modulos detail agora sempre v&atilde;o ficar
  na cor branca.</li>
  <li> Adicionado mais dois tipos de botoes para o modulo:<br>
    Buttom Popup e 
    Image Popup<br>
    * Ambos fazem a mesma coisa que os botoes Image e Buttom,<br>
    a unica diferen&ccedil;a &eacute; que &eacute; possivel colocar a&ccedil;oes javascript 
  ao inves de so colocar a url. </li>
  <li> Ajuste na tela de configura&ccedil;oes para adicionar campos 
  na listagem em um modulo. <br>
  Quando o mesmo era detail ele
  n&atilde;o estava sendo redimensionado.</li>
</font></ul>

<h3>v4.1.1-9 (21/03/2009 a 02/04/2009) </h3>

<ul><font face="verdana,arial" size="2">
  <li>Permite navegar pela pagina&ccedil;&atilde;o com a setas para a <br>
  direita( avan&ccedil;ar ) e esquerda( voltar ).</li>
  <li>Adicionado os seguintes tipo de target no descritor<br>
  links:<br>
  _blank<br>
  _self<br>
  _parent<br>
  _top<br>
  popup<br>
  javascript<br>
  detail<br>
  Frame Principal<br>
  Frame Left<br>
  Frame main<br>
  Frame menu</li>
  <li>Adicionado o campo field_master_detail no descritor links.<br>
    Este campo foi adicionado para inserir o nome do campo da chave
  primaria, chave pai, <br>
  quando o target for do tipo detail.</li>
  <li>Agora &eacute; possivel dar submit dos filtros dos modulos
  atraves da tecla ENTER.</li>
  <li> Consertado o problema do getElementById quando 
  o modulo era acessado.</li>
  <li>Adicionado mais dois tipos de menu nas grades. Os tipos 
    s&atilde;o:<br>
    *MENU -&gt;Simula um combo<br>
    *TAB  -&gt;Estilo fichas do windows</li>
  <li>Nas grades (DATA.PHP) a montagem do combo de menu a 
  direita n&atilde;o pode respeitar o <br>
  default do 180px; no CSS
  o combo tem o valor que precisar (auto)<br>
  </li>
</font></ul>

<h3>v4.0.1-9 (21/03/2009) </h3>

<ul><font face="verdana,arial" size="2">
  <li> 01 As grades (DATA.PHP) rodam apartir do 
submit apartir do form dos filtros
    <ul>
      <li>1.1 Isso permite que os os default de
        pesquisa sejam feitos neles</li>
      <li>1.2 Os comparativos de valores default 
  para podem ser feitos pelo TEXT ou pelo 
  VALUE</li>
    </ul>
  </li>
  <li>02 Permitinmos a inser&ccedil;&atilde;o de fun&ccedil;&otilde;es em eventos 
  para qualqeur campo
    <ul>
      <li>2.1 Obs.: Na montagem do filtro observar que 
  a rela&ccedil;&atilde;o direta (tabela pai) permanece <br>
  igual, por&eacute;m no n&iacute;vel acima (av&ocirc;, etc..)
        devemos relacionar com a pr&oacute;pria tabela 
        do filtro</li>
    </ul>
  </li>
  <li>03 Bypas - Permite que possmaos adicionar campos 
  sem que estes sejam enviados no submit do form</li>
  <li>04 Ajuste na exporta&ccedil;&atilde;o de dialogs para word e excel</li>
  <li>05 Tamanho dos combnos 
    <ul>
      <li>5.1 Aticamos o droplist &quot;inteligente&quot; dos combos 
        para IE (funcionar parecido com o FF)</li>
      <li>5.2 O combos passaram, a ter um tamanho default 
  no CSS (180px)</li>
      <li>5.3 No banco param_combo_witdh ficou tamb&eacute;m com
  este mesmo default</li>
      <li>5.4 Funionamento:<br>
        Ativado <br>
  param_combo_witdh = 0<br>
  eventos = onBlur;onMouseDown;onChange;onMouseup;<br>
  fun&ccedil;&otilde;es = [blurCombo(this)]<br>
  [mouseDownCombo(this)]<br>
  [changeCombo(this)]<br>
  [mouseUpCombo(this)]<br>
  Desativado <br>
  param_combo_witdh &lt;&gt; 0<br>
  * n&atilde;o colocar os eventos nemas fun&ccedil;&otilde;es</li>
    </ul>
  </li>
  <li>06 Ajuste dafun&ccedil;&atilde;o de popupoar combo, funcionava apenas 
    para o IE agora funciona tamb&eacute;m apra o FF</li>
  <li>07 Faltava &quot;return false;&quot; no STCopyusuario</li>
  <li>08 Fun&ccedil;&atilde;o retuarndadso foi retirado o tratamento do &quot;\n&quot;</li>
  <li>09 Tratamento de erro na montacombo </li>
  <li>11 Ajust de layout CSS - hack na transpar&ecirc;ncia
    <br>
  </li>
</font></ul>

<h3 align="left"><font color="#264B99">v4.0.0.0 (01/12/2008) </font></h3>
<ul><font face="verdana,arial" size="2">
  <li>
    <p align="left"><font color="#264B99">Primeira vers&atilde;o publicada para libera&ccedil;&atilde;o de implementa&ccedil;&atilde;o de sitemas</font></p>
  </li>
</font></ul>
<h3>v3 (01/04/2008 a 01/10/2008) </h3>
<ul><font face="verdana,arial" size="2">
  <li>Tabelas e campos edit&aacute;veis - m&oacute;dulos criadores de m&oacute;dulos </li>
  <li>Menu inicial rudimentar - MAPA</li>
  <li>Inser&ccedil;&atilde;o ao suporte multi-linguas </li>
</font></ul>
<h3>v2 (01/5/2007 a 01/03/2008) </h3>
<ul><font face="verdana,arial" size="2">
  <li>Modelagem do framework e kernel em si</li>
  <li>Convers&atilde;o de fun&ccedil;&otilde;es ASP e conceitos do athCSM para PHP</li>
  <li>Interpretador rudimentar de Relat&oacute;rios ASL - pard&atilde;o web usando como refer&ecirc;ncia <br>
    o subset de linguagem SQL chamado ASL criado originalmente para o sistema ATHEMIS <br>
  </li>
</font></ul>
<p>&nbsp;</p>
<table width="100%" border="0" cellpadding="5" cellspacing="0">
  <tr>
    <td align="center" bgcolor="#264b99"><font face="verdana,arial" size="6" color="#FFFFFF"><b>KernelPS</b></font><br>
    <b><font face="verdana,arial" size="4" color="#FFFFFF">Previsões para as próximas
    versões</font></b></td>
  </tr>
</table>
<p><br>
  Nosso objetivo aqui é descrever as funcionalidades
nas quais estamos trabalhando para a próxima versão 
do KernelPS que abrange atualmente os sistemas que foram desenvolvidos apartir dele: <strong>(DataWide,  Cemisys, Tradeunion, PStudio, PLite e Criatriz)</strong>.<br>
<br>
Não entraremos em detalhes para manter sigilo sobre os novos lançamentos.</p>
<h3>Funcionalidades</h3>

<ul>
  <li>Encapsulamento do n&uacute;cleo e demais rotinas em classes</li>
  <li>Objetos/Scripts de kernel destinados aso m&oacute;dulos dever&atilde;o ser usados de forma &uacute;nica</li>
  <li>Relatórios estatísticos dos dados armazenados</li>
  <li>Novos plug-ins com novas funcionalidades</li>
  <li>Suporte avan&ccedil;ado e novo framework para trabalho com AJAX</li>
  <li>Disponibiliza&ccedil;&atilde;o de biblioteca permitindo que o sistema funcione como webservice</li>
  <li>Pesquisa geral - pesquisa de dado (texto ou num) dentro do banco de dados em qualquer campo ou tabela</li>
  <li>Unificação modular - rotinas 'dinâmicas' em "_database": data, insupddelmastereditor, etc...</li>
</ul>

<h3>Integra&ccedil;&otilde;es</h3>

<ul>
  <li>Pesquisa integrada entre os sistemas do Kernel, formata&ccedil;&atilde;o de uma API que permita <br>
  pesqueisa gerais, por exemplo, encontrar resultados de um CPF em todso os sistems e BD do Kernel </li>
  <li>Possibilidade de replica&ccedil;&atilde;o n&atilde;o nativa do postgree </li>
  <li>Integra&ccedil;&atilde;o com API Google e possibilidade sub-m&oacute;dulos ligados ao Facebook</li>
</ul>

<h3>Help</h3>

<ul>
  <li>Manual de opera&ccedil;&atilde;o e configura&ccedil;&atilde;o de sistemas com o KernelPS</li>
  <li>Manual de desenvolvimento, regras e frameworks  para novos desenvolvedores <br>
    <br>
  </li>
</ul>

<hr>


<p>  Atenciosamente, <br>
  <b>Alessander Olivera</b> - <span style="font-size:12px">DIRETOR de PROJETOS e CRIA&Ccedil;&Atilde;O</span> <br>
<b>PROEVENTO - <span style="font-size:12px">T E C H N O L O G I E S</span></b> - <a href="http://www.proevento.com.br" target="_blank">www.proevento.com.br</a></p>
<hr>
</body>
</html>